app/views/main/index.haml

              =@courses.size
              ="course#{@courses.size == 1 ? "" : "s"}"
---
SELECT "courses".* FROM "courses" WHERE (name LIKE '%jazz%')