app/controllers/main_controller.rb

	def index
		@query = params[:query].try(:strip)

		@courses = nil
		if @query && !@query.empty?
			@courses = filter(search_for_courses(@query))
		elsif params["random"].presence
			#random everything, but include stuff
			c_lo, c_hi = credits_range(params["credits"])
			@courses = Course.limit(1).where do
				[
					c_low.presence && credits >= c_lo,
					c_hi.presence && credits <= c_hi,
					course_type == Course::Type::Course,
					desc != nil
				].compact.reduce(:&)
			end.order("RANDOM()")
		else
			@depts = Department.all
---
SELECT "courses".* FROM "courses" WHERE (name LIKE '%jazz%')
SELECT "departments".* FROM "departments" WHERE (short LIKE '%aas 222%') ORDER BY "departments"."id" ASC LIMIT 1